


Network Working Group                                   R. Fielding, Ed.
Internet-Draft                                              Day Software
Obsoletes: 2068, 2616                                          J. Gettys
(if approved)                                       One Laptop per Child
Intended status: Standards Track                                J. Mogul
Expires: June 20, 2008                                                HP
                                                              H. Frystyk
                                                               Microsoft
                                                             L. Masinter
                                                           Adobe Systems
                                                                P. Leach
                                                               Microsoft
                                                          T. Berners-Lee
                                                                 W3C/MIT
                                                       December 18, 2007


                  HTTP/1.1, part 2: Message Semantics
                   draft-ietf-httpbis-p2-semantics-00

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on June 20, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2007).



Fielding, et al.          Expires June 20, 2008                 [Page 1]

Internet-Draft                  HTTP/1.1                   December 2007


Abstract

   The Hypertext Transfer Protocol (HTTP) is an application-level
   protocol for distributed, collaborative, hypermedia information
   systems.  HTTP has been in use by the World Wide Web global
   information initiative since 1990.  This document is Part 2 of the
   seven-part specification that defines the protocol referred to as
   "HTTP/1.1" and, taken together, obsoletes RFC 2616.  Part 2 defines
   the semantics of HTTP messages as expressed by request methods,
   request-header fields, response status codes, and response-header
   fields.

Editorial Note (To be removed by RFC Editor)

   This version of the HTTP specification contains only minimal
   editorial changes from [RFC2616] (abstract, introductory paragraph,
   and authors' addresses).  All other changes are due to partitioning
   the original into seven mostly independent parts.  The intent is for
   readers of future drafts to able to use draft 00 as the basis for
   comparison when the WG makes later changes to the specification text.
   This draft will shortly be followed by draft 01 (containing the first
   round of changes that have already been agreed to on the mailing
   list).  There is no point in reviewing this draft other than to
   verify that the partitioning has been done correctly.  Roy T.
   Fielding, Yves Lafon, and Julian Reschke will be the editors after
   draft 00 is submitted.

   Discussion of this draft should take place on the HTTPBIS working
   group mailing list (ietf-http-wg@w3.org).  The current issues list is
   at <http://www.w3.org/Protocols/HTTP/1.1/rfc2616bis/issues/> and
   related documents (including fancy diffs) can be found at
   <http://www3.tools.ietf.org/wg/httpbis/>.



















Fielding, et al.          Expires June 20, 2008                 [Page 2]

Internet-Draft                  HTTP/1.1                   December 2007


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  5
   2.  Product Tokens . . . . . . . . . . . . . . . . . . . . . . . .  5
   3.  Method . . . . . . . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Request Header Fields  . . . . . . . . . . . . . . . . . . . .  6
   5.  Status Code and Reason Phrase  . . . . . . . . . . . . . . . .  7
   6.  Response Header Fields . . . . . . . . . . . . . . . . . . . .  9
   7.  Entity . . . . . . . . . . . . . . . . . . . . . . . . . . . .  9
   8.  Method Definitions . . . . . . . . . . . . . . . . . . . . . . 10
     8.1.  Safe and Idempotent Methods  . . . . . . . . . . . . . . . 10
       8.1.1.  Safe Methods . . . . . . . . . . . . . . . . . . . . . 10
       8.1.2.  Idempotent Methods . . . . . . . . . . . . . . . . . . 10
     8.2.  OPTIONS  . . . . . . . . . . . . . . . . . . . . . . . . . 11
     8.3.  GET  . . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     8.4.  HEAD . . . . . . . . . . . . . . . . . . . . . . . . . . . 12
     8.5.  POST . . . . . . . . . . . . . . . . . . . . . . . . . . . 13
     8.6.  PUT  . . . . . . . . . . . . . . . . . . . . . . . . . . . 14
     8.7.  DELETE . . . . . . . . . . . . . . . . . . . . . . . . . . 15
     8.8.  TRACE  . . . . . . . . . . . . . . . . . . . . . . . . . . 15
     8.9.  CONNECT  . . . . . . . . . . . . . . . . . . . . . . . . . 16
   9.  Status Code Definitions  . . . . . . . . . . . . . . . . . . . 16
     9.1.  Informational 1xx  . . . . . . . . . . . . . . . . . . . . 16
       9.1.1.  100 Continue . . . . . . . . . . . . . . . . . . . . . 16
       9.1.2.  101 Switching Protocols  . . . . . . . . . . . . . . . 17
     9.2.  Successful 2xx . . . . . . . . . . . . . . . . . . . . . . 17
       9.2.1.  200 OK . . . . . . . . . . . . . . . . . . . . . . . . 17
       9.2.2.  201 Created  . . . . . . . . . . . . . . . . . . . . . 17
       9.2.3.  202 Accepted . . . . . . . . . . . . . . . . . . . . . 18
       9.2.4.  203 Non-Authoritative Information  . . . . . . . . . . 18
       9.2.5.  204 No Content . . . . . . . . . . . . . . . . . . . . 18
       9.2.6.  205 Reset Content  . . . . . . . . . . . . . . . . . . 19
       9.2.7.  206 Partial Content  . . . . . . . . . . . . . . . . . 19
     9.3.  Redirection 3xx  . . . . . . . . . . . . . . . . . . . . . 19
       9.3.1.  300 Multiple Choices . . . . . . . . . . . . . . . . . 19
       9.3.2.  301 Moved Permanently  . . . . . . . . . . . . . . . . 20
       9.3.3.  302 Found  . . . . . . . . . . . . . . . . . . . . . . 20
       9.3.4.  303 See Other  . . . . . . . . . . . . . . . . . . . . 21
       9.3.5.  304 Not Modified . . . . . . . . . . . . . . . . . . . 21
       9.3.6.  305 Use Proxy  . . . . . . . . . . . . . . . . . . . . 21
       9.3.7.  306 (Unused) . . . . . . . . . . . . . . . . . . . . . 22
       9.3.8.  307 Temporary Redirect . . . . . . . . . . . . . . . . 22
     9.4.  Client Error 4xx . . . . . . . . . . . . . . . . . . . . . 22
       9.4.1.  400 Bad Request  . . . . . . . . . . . . . . . . . . . 23
       9.4.2.  401 Unauthorized . . . . . . . . . . . . . . . . . . . 23
       9.4.3.  402 Payment Required . . . . . . . . . . . . . . . . . 23
       9.4.4.  403 Forbidden  . . . . . . . . . . . . . . . . . . . . 23
       9.4.5.  404 Not Found  . . . . . . . . . . . . . . . . . . . . 23



Fielding, et al.          Expires June 20, 2008                 [Page 3]

Internet-Draft                  HTTP/1.1                   December 2007


       9.4.6.  405 Method Not Allowed . . . . . . . . . . . . . . . . 23
       9.4.7.  406 Not Acceptable . . . . . . . . . . . . . . . . . . 23
       9.4.8.  407 Proxy Authentication Required  . . . . . . . . . . 24
       9.4.9.  408 Request Timeout  . . . . . . . . . . . . . . . . . 24
       9.4.10. 409 Conflict . . . . . . . . . . . . . . . . . . . . . 24
       9.4.11. 410 Gone . . . . . . . . . . . . . . . . . . . . . . . 25
       9.4.12. 411 Length Required  . . . . . . . . . . . . . . . . . 25
       9.4.13. 412 Precondition Failed  . . . . . . . . . . . . . . . 25
       9.4.14. 413 Request Entity Too Large . . . . . . . . . . . . . 25
       9.4.15. 414 Request-URI Too Long . . . . . . . . . . . . . . . 26
       9.4.16. 415 Unsupported Media Type . . . . . . . . . . . . . . 26
       9.4.17. 416 Requested Range Not Satisfiable  . . . . . . . . . 26
       9.4.18. 417 Expectation Failed . . . . . . . . . . . . . . . . 26
     9.5.  Server Error 5xx . . . . . . . . . . . . . . . . . . . . . 26
       9.5.1.  500 Internal Server Error  . . . . . . . . . . . . . . 26
       9.5.2.  501 Not Implemented  . . . . . . . . . . . . . . . . . 27
       9.5.3.  502 Bad Gateway  . . . . . . . . . . . . . . . . . . . 27
       9.5.4.  503 Service Unavailable  . . . . . . . . . . . . . . . 27
       9.5.5.  504 Gateway Timeout  . . . . . . . . . . . . . . . . . 27
       9.5.6.  505 HTTP Version Not Supported . . . . . . . . . . . . 27
   10. Header Field Definitions . . . . . . . . . . . . . . . . . . . 28
     10.1. Allow  . . . . . . . . . . . . . . . . . . . . . . . . . . 28
     10.2. Expect . . . . . . . . . . . . . . . . . . . . . . . . . . 28
     10.3. From . . . . . . . . . . . . . . . . . . . . . . . . . . . 29
     10.4. Location . . . . . . . . . . . . . . . . . . . . . . . . . 30
     10.5. Max-Forwards . . . . . . . . . . . . . . . . . . . . . . . 30
     10.6. Referer  . . . . . . . . . . . . . . . . . . . . . . . . . 31
     10.7. Retry-After  . . . . . . . . . . . . . . . . . . . . . . . 31
     10.8. Server . . . . . . . . . . . . . . . . . . . . . . . . . . 32
     10.9. User-Agent . . . . . . . . . . . . . . . . . . . . . . . . 32
   11. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 33
   12. Security Considerations  . . . . . . . . . . . . . . . . . . . 33
     12.1. Transfer of Sensitive Information  . . . . . . . . . . . . 33
     12.2. Encoding Sensitive Information in URI's  . . . . . . . . . 34
     12.3. Location Headers and Spoofing  . . . . . . . . . . . . . . 34
   13. Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 34
   14. References . . . . . . . . . . . . . . . . . . . . . . . . . . 34
   Appendix A.  Changes from RFC 2068 . . . . . . . . . . . . . . . . 36
   Index  . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 37
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 40
   Intellectual Property and Copyright Statements . . . . . . . . . . 43










Fielding, et al.          Expires June 20, 2008                 [Page 4]

Internet-Draft                  HTTP/1.1                   December 2007


1.  Introduction

   This document will define aspects of HTTP related to request and
   response semantics.  Right now it only includes the extracted
   relevant sections of RFC 2616 with only minor edits.

   The HTTP protocol is a request/response protocol.  A client sends a
   request to the server in the form of a request method, URI, and
   protocol version, followed by a MIME-like message containing request
   modifiers, client information, and possible body content over a
   connection with a server.  The server responds with a status line,
   including the message's protocol version and a success or error code,
   followed by a MIME-like message containing server information, entity
   metainformation, and possible entity-body content.  The relationship
   between HTTP and MIME is described in Appendix A of [Part3].


2.  Product Tokens

   Product tokens are used to allow communicating applications to
   identify themselves by software name and version.  Most fields using
   product tokens also allow sub-products which form a significant part
   of the application to be listed, separated by white space.  By
   convention, the products are listed in order of their significance
   for identifying the application.

       product         = token ["/" product-version]
       product-version = token

   Examples:

       User-Agent: CERN-LineMode/2.15 libwww/2.17b3
       Server: Apache/0.8.4

   Product tokens SHOULD be short and to the point.  They MUST NOT be
   used for advertising or other non-essential information.  Although
   any token character MAY appear in a product-version, this token
   SHOULD only be used for a version identifier (i.e., successive
   versions of the same product SHOULD only differ in the product-
   version portion of the product value).


3.  Method

   The Method token indicates the method to be performed on the resource
   identified by the Request-URI.  The method is case-sensitive.





Fielding, et al.          Expires June 20, 2008                 [Page 5]

Internet-Draft                  HTTP/1.1                   December 2007


       Method         = "OPTIONS"                ; Section 8.2
                      | "GET"                    ; Section 8.3
                      | "HEAD"                   ; Section 8.4
                      | "POST"                   ; Section 8.5
                      | "PUT"                    ; Section 8.6
                      | "DELETE"                 ; Section 8.7
                      | "TRACE"                  ; Section 8.8
                      | "CONNECT"                ; Section 8.9
                      | extension-method
       extension-method = token

   The list of methods allowed by a resource can be specified in an
   Allow header field (Section 10.1).  The return code of the response
   always notifies the client whether a method is currently allowed on a
   resource, since the set of allowed methods can change dynamically.
   An origin server SHOULD return the status code 405 (Method Not
   Allowed) if the method is known by the origin server but not allowed
   for the requested resource, and 501 (Not Implemented) if the method
   is unrecognized or not implemented by the origin server.  The methods
   GET and HEAD MUST be supported by all general-purpose servers.  All
   other methods are OPTIONAL; however, if the above methods are
   implemented, they MUST be implemented with the same semantics as
   those specified in Section 8.


4.  Request Header Fields

   The request-header fields allow the client to pass additional
   information about the request, and about the client itself, to the
   server.  These fields act as request modifiers, with semantics
   equivalent to the parameters on a programming language method
   invocation.



















Fielding, et al.          Expires June 20, 2008                 [Page 6]

Internet-Draft                  HTTP/1.1                   December 2007


       request-header = Accept                   ; [Part3], Section 5.1
                      | Accept-Charset           ; [Part3], Section 5.2
                      | Accept-Encoding          ; [Part3], Section 5.3
                      | Accept-Language          ; [Part3], Section 5.4
                      | Authorization            ; [Part7], Section 3.1
                      | Expect                   ; Section 10.2
                      | From                     ; Section 10.3
                      | Host                     ; [Part1], Section 8.4
                      | If-Match                 ; [Part4], Section 6.2
                      | If-Modified-Since        ; [Part4], Section 6.3
                      | If-None-Match            ; [Part4], Section 6.4
                      | If-Range                 ; [Part5], Section 5.3
                      | If-Unmodified-Since      ; [Part4], Section 6.5
                      | Max-Forwards             ; Section 10.5
                      | Proxy-Authorization      ; [Part7], Section 3.3
                      | Range                    ; [Part5], Section 5.4
                      | Referer                  ; Section 10.6
                      | TE                       ; [Part1], Section 8.8
                      | User-Agent               ; Section 10.9

   Request-header field names can be extended reliably only in
   combination with a change in the protocol version.  However, new or
   experimental header fields MAY be given the semantics of request-
   header fields if all parties in the communication recognize them to
   be request-header fields.  Unrecognized header fields are treated as
   entity-header fields.


5.  Status Code and Reason Phrase

   The Status-Code element is a 3-digit integer result code of the
   attempt to understand and satisfy the request.  These codes are fully
   defined in Section 9.  The Reason-Phrase is intended to give a short
   textual description of the Status-Code.  The Status-Code is intended
   for use by automata and the Reason-Phrase is intended for the human
   user.  The client is not required to examine or display the Reason-
   Phrase.

   The individual values of the numeric status codes defined for
   HTTP/1.1, and an example set of corresponding Reason-Phrase's, are
   presented below.  The reason phrases listed here are only
   recommendations -- they MAY be replaced by local equivalents without
   affecting the protocol.








Fielding, et al.          Expires June 20, 2008                 [Page 7]

Internet-Draft                  HTTP/1.1                   December 2007


      Status-Code    =
            "100"  ; Section 9.1.1: Continue
          | "101"  ; Section 9.1.2: Switching Protocols
          | "200"  ; Section 9.2.1: OK
          | "201"  ; Section 9.2.2: Created
          | "202"  ; Section 9.2.3: Accepted
          | "203"  ; Section 9.2.4: Non-Authoritative Information
          | "204"  ; Section 9.2.5: No Content
          | "205"  ; Section 9.2.6: Reset Content
          | "206"  ; Section 9.2.7: Partial Content
          | "300"  ; Section 9.3.1: Multiple Choices
          | "301"  ; Section 9.3.2: Moved Permanently
          | "302"  ; Section 9.3.3: Found
          | "303"  ; Section 9.3.4: See Other
          | "304"  ; Section 9.3.5: Not Modified
          | "305"  ; Section 9.3.6: Use Proxy
          | "307"  ; Section 9.3.8: Temporary Redirect
          | "400"  ; Section 9.4.1: Bad Request
          | "401"  ; Section 9.4.2: Unauthorized
          | "402"  ; Section 9.4.3: Payment Required
          | "403"  ; Section 9.4.4: Forbidden
          | "404"  ; Section 9.4.5: Not Found
          | "405"  ; Section 9.4.6: Method Not Allowed
          | "406"  ; Section 9.4.7: Not Acceptable
          | "407"  ; Section 9.4.8: Proxy Authentication Required
          | "408"  ; Section 9.4.9: Request Time-out
          | "409"  ; Section 9.4.10: Conflict
          | "410"  ; Section 9.4.11: Gone
          | "411"  ; Section 9.4.12: Length Required
          | "412"  ; Section 9.4.13: Precondition Failed
          | "413"  ; Section 9.4.14: Request Entity Too Large
          | "414"  ; Section 9.4.15: Request-URI Too Large
          | "415"  ; Section 9.4.16: Unsupported Media Type
          | "416"  ; Section 9.4.17: Requested range not satisfiable
          | "417"  ; Section 9.4.18: Expectation Failed
          | "500"  ; Section 9.5.1: Internal Server Error
          | "501"  ; Section 9.5.2: Not Implemented
          | "502"  ; Section 9.5.3: Bad Gateway
          | "503"  ; Section 9.5.4: Service Unavailable
          | "504"  ; Section 9.5.5: Gateway Time-out
          | "505"  ; Section 9.5.6: HTTP Version not supported
          | extension-code

      extension-code = 3DIGIT
      Reason-Phrase  = *<TEXT, excluding CR, LF>

   HTTP status codes are extensible.  HTTP applications are not required
   to understand the meaning of all registered status codes, though such



Fielding, et al.          Expires June 20, 2008                 [Page 8]

Internet-Draft                  HTTP/1.1                   December 2007


   understanding is obviously desirable.  However, applications MUST
   understand the class of any status code, as indicated by the first
   digit, and treat any unrecognized response as being equivalent to the
   x00 status code of that class, with the exception that an
   unrecognized response MUST NOT be cached.  For example, if an
   unrecognized status code of 431 is received by the client, it can
   safely assume that there was something wrong with its request and
   treat the response as if it had received a 400 status code.  In such
   cases, user agents SHOULD present to the user the entity returned
   with the response, since that entity is likely to include human-
   readable information which will explain the unusual status.


6.  Response Header Fields

   The response-header fields allow the server to pass additional
   information about the response which cannot be placed in the Status-
   Line.  These header fields give information about the server and
   about further access to the resource identified by the Request-URI.

       response-header = Accept-Ranges           ; [Part5], Section 5.1
                       | Age                     ; [Part6], Section 3.1
                       | ETag                    ; [Part4], Section 6.1
                       | Location                ; Section 10.4
                       | Proxy-Authenticate      ; [Part7], Section 3.2
                       | Retry-After             ; Section 10.7
                       | Server                  ; Section 10.8
                       | Vary                    ; [Part6], Section 3.5
                       | WWW-Authenticate        ; [Part7], Section 3.4

   Response-header field names can be extended reliably only in
   combination with a change in the protocol version.  However, new or
   experimental header fields MAY be given the semantics of response-
   header fields if all parties in the communication recognize them to
   be response-header fields.  Unrecognized header fields are treated as
   entity-header fields.


7.  Entity

   Request and Response messages MAY transfer an entity if not otherwise
   restricted by the request method or response status code.  An entity
   consists of entity-header fields and an entity-body, although some
   responses will only include the entity-headers.  HTTP entity-body and
   entity-header fields are defined in [Part3].

   An entity-body is only present in a message when a message-body is
   present, as described in Section 4.3 of [Part1].  The entity-body is



Fielding, et al.          Expires June 20, 2008                 [Page 9]

Internet-Draft                  HTTP/1.1                   December 2007


   obtained from the message-body by decoding any Transfer-Encoding that
   might have been applied to ensure safe and proper transfer of the
   message.


8.  Method Definitions

   The set of common methods for HTTP/1.1 is defined below.  Although
   this set can be expanded, additional methods cannot be assumed to
   share the same semantics for separately extended clients and servers.
   The Host request-header field (Section 8.4 of [Part1]) MUST accompany
   all HTTP/1.1 requests.

8.1.  Safe and Idempotent Methods

8.1.1.  Safe Methods

   Implementors should be aware that the software represents the user in
   their interactions over the Internet, and should be careful to allow
   the user to be aware of any actions they might take which may have an
   unexpected significance to themselves or others.

   In particular, the convention has been established that the GET and
   HEAD methods SHOULD NOT have the significance of taking an action
   other than retrieval.  These methods ought to be considered "safe".
   This allows user agents to represent other methods, such as POST, PUT
   and DELETE, in a special way, so that the user is made aware of the
   fact that a possibly unsafe action is being requested.

   Naturally, it is not possible to ensure that the server does not
   generate side-effects as a result of performing a GET request; in
   fact, some dynamic resources consider that a feature.  The important
   distinction here is that the user did not request the side-effects,
   so therefore cannot be held accountable for them.

8.1.2.  Idempotent Methods

   Methods can also have the property of "idempotence" in that (aside
   from error or expiration issues) the side-effects of N > 0 identical
   requests is the same as for a single request.  The methods GET, HEAD,
   PUT and DELETE share this property.  Also, the methods OPTIONS and
   TRACE SHOULD NOT have side effects, and so are inherently idempotent.

   However, it is possible that a sequence of several requests is non-
   idempotent, even if all of the methods executed in that sequence are
   idempotent.  (A sequence is idempotent if a single execution of the
   entire sequence always yields a result that is not changed by a
   reexecution of all, or part, of that sequence.)  For example, a



Fielding, et al.          Expires June 20, 2008                [Page 10]

Internet-Draft                  HTTP/1.1                   December 2007


   sequence is non-idempotent if its result depends on a value that is
   later modified in the same sequence.

   A sequence that never has side effects is idempotent, by definition
   (provided that no concurrent operations are being executed on the
   same set of resources).

8.2.  OPTIONS

   The OPTIONS method represents a request for information about the
   communication options available on the request/response chain
   identified by the Request-URI.  This method allows the client to
   determine the options and/or requirements associated with a resource,
   or the capabilities of a server, without implying a resource action
   or initiating a resource retrieval.

   Responses to this method are not cacheable.

   If the OPTIONS request includes an entity-body (as indicated by the
   presence of Content-Length or Transfer-Encoding), then the media type
   MUST be indicated by a Content-Type field.  Although this
   specification does not define any use for such a body, future
   extensions to HTTP might use the OPTIONS body to make more detailed
   queries on the server.  A server that does not support such an
   extension MAY discard the request body.

   If the Request-URI is an asterisk ("*"), the OPTIONS request is
   intended to apply to the server in general rather than to a specific
   resource.  Since a server's communication options typically depend on
   the resource, the "*" request is only useful as a "ping" or "no-op"
   type of method; it does nothing beyond allowing the client to test
   the capabilities of the server.  For example, this can be used to
   test a proxy for HTTP/1.1 compliance (or lack thereof).

   If the Request-URI is not an asterisk, the OPTIONS request applies
   only to the options that are available when communicating with that
   resource.

   A 200 response SHOULD include any header fields that indicate
   optional features implemented by the server and applicable to that
   resource (e.g., Allow), possibly including extensions not defined by
   this specification.  The response body, if any, SHOULD also include
   information about the communication options.  The format for such a
   body is not defined by this specification, but might be defined by
   future extensions to HTTP.  Content negotiation MAY be used to select
   the appropriate response format.  If no response body is included,
   the response MUST include a Content-Length field with a field-value
   of "0".



Fielding, et al.          Expires June 20, 2008                [Page 11]

Internet-Draft                  HTTP/1.1                   December 2007


   The Max-Forwards request-header field MAY be used to target a
   specific proxy in the request chain.  When a proxy receives an
   OPTIONS request on an absoluteURI for which request forwarding is
   permitted, the proxy MUST check for a Max-Forwards field.  If the
   Max-Forwards field-value is zero ("0"), the proxy MUST NOT forward
   the message; instead, the proxy SHOULD respond with its own
   communication options.  If the Max-Forwards field-value is an integer
   greater than zero, the proxy MUST decrement the field-value when it
   forwards the request.  If no Max-Forwards field is present in the
   request, then the forwarded request MUST NOT include a Max-Forwards
   field.

8.3.  GET

   The GET method means retrieve whatever information (in the form of an
   entity) is identified by the Request-URI.  If the Request-URI refers
   to a data-producing process, it is the produced data which shall be
   returned as the entity in the response and not the source text of the
   process, unless that text happens to be the output of the process.

   The semantics of the GET method change to a "conditional GET" if the
   request message includes an If-Modified-Since, If-Unmodified-Since,
   If-Match, If-None-Match, or If-Range header field.  A conditional GET
   method requests that the entity be transferred only under the
   circumstances described by the conditional header field(s).  The
   conditional GET method is intended to reduce unnecessary network
   usage by allowing cached entities to be refreshed without requiring
   multiple requests or transferring data already held by the client.

   The semantics of the GET method change to a "partial GET" if the
   request message includes a Range header field.  A partial GET
   requests that only part of the entity be transferred, as described in
   Section 5.4 of [Part5].  The partial GET method is intended to reduce
   unnecessary network usage by allowing partially-retrieved entities to
   be completed without transferring data already held by the client.

   The response to a GET request is cacheable if and only if it meets
   the requirements for HTTP caching described in [Part6].

   See Section 12.2 for security considerations when used for forms.

8.4.  HEAD

   The HEAD method is identical to GET except that the server MUST NOT
   return a message-body in the response.  The metainformation contained
   in the HTTP headers in response to a HEAD request SHOULD be identical
   to the information sent in response to a GET request.  This method
   can be used for obtaining metainformation about the entity implied by



Fielding, et al.          Expires June 20, 2008                [Page 12]

Internet-Draft                  HTTP/1.1                   December 2007


   the request without transferring the entity-body itself.  This method
   is often used for testing hypertext links for validity,
   accessibility, and recent modification.

   The response to a HEAD request MAY be cacheable in the sense that the
   information contained in the response MAY be used to update a
   previously cached entity from that resource.  If the new field values
   indicate that the cached entity differs from the current entity (as
   would be indicated by a change in Content-Length, Content-MD5, ETag
   or Last-Modified), then the cache MUST treat the cache entry as
   stale.

8.5.  POST

   The POST method is used to request that the origin server accept the
   entity enclosed in the request as a new subordinate of the resource
   identified by the Request-URI in the Request-Line.  POST is designed
   to allow a uniform method to cover the following functions:

   o  Annotation of existing resources;

   o  Posting a message to a bulletin board, newsgroup, mailing list, or
      similar group of articles;

   o  Providing a block of data, such as the result of submitting a
      form, to a data-handling process;

   o  Extending a database through an append operation.

   The actual function performed by the POST method is determined by the
   server and is usually dependent on the Request-URI.  The posted
   entity is subordinate to that URI in the same way that a file is
   subordinate to a directory containing it, a news article is
   subordinate to a newsgroup to which it is posted, or a record is
   subordinate to a database.

   The action performed by the POST method might not result in a
   resource that can be identified by a URI.  In this case, either 200
   (OK) or 204 (No Content) is the appropriate response status,
   depending on whether or not the response includes an entity that
   describes the result.

   If a resource has been created on the origin server, the response
   SHOULD be 201 (Created) and contain an entity which describes the
   status of the request and refers to the new resource, and a Location
   header (see Section 10.4).

   Responses to this method are not cacheable, unless the response



Fielding, et al.          Expires June 20, 2008                [Page 13]

Internet-Draft                  HTTP/1.1                   December 2007


   includes appropriate Cache-Control or Expires header fields.
   However, the 303 (See Other) response can be used to direct the user
   agent to retrieve a cacheable resource.

   POST requests MUST obey the message transmission requirements set out
   in Section 7.2 of [Part1].

   See Section 12.2 for security considerations.

8.6.  PUT

   The PUT method requests that the enclosed entity be stored under the
   supplied Request-URI.  If the Request-URI refers to an already
   existing resource, the enclosed entity SHOULD be considered as a
   modified version of the one residing on the origin server.  If the
   Request-URI does not point to an existing resource, and that URI is
   capable of being defined as a new resource by the requesting user
   agent, the origin server can create the resource with that URI.  If a
   new resource is created, the origin server MUST inform the user agent
   via the 201 (Created) response.  If an existing resource is modified,
   either the 200 (OK) or 204 (No Content) response codes SHOULD be sent
   to indicate successful completion of the request.  If the resource
   could not be created or modified with the Request-URI, an appropriate
   error response SHOULD be given that reflects the nature of the
   problem.  The recipient of the entity MUST NOT ignore any Content-*
   (e.g.  Content-Range) headers that it does not understand or
   implement and MUST return a 501 (Not Implemented) response in such
   cases.

   If the request passes through a cache and the Request-URI identifies
   one or more currently cached entities, those entries SHOULD be
   treated as stale.  Responses to this method are not cacheable.

   The fundamental difference between the POST and PUT requests is
   reflected in the different meaning of the Request-URI.  The URI in a
   POST request identifies the resource that will handle the enclosed
   entity.  That resource might be a data-accepting process, a gateway
   to some other protocol, or a separate entity that accepts
   annotations.  In contrast, the URI in a PUT request identifies the
   entity enclosed with the request -- the user agent knows what URI is
   intended and the server MUST NOT attempt to apply the request to some
   other resource.  If the server desires that the request be applied to
   a different URI, it MUST send a 301 (Moved Permanently) response; the
   user agent MAY then make its own decision regarding whether or not to
   redirect the request.

   A single resource MAY be identified by many different URIs.  For
   example, an article might have a URI for identifying "the current



Fielding, et al.          Expires June 20, 2008                [Page 14]

Internet-Draft                  HTTP/1.1                   December 2007


   version" which is separate from the URI identifying each particular
   version.  In this case, a PUT request on a general URI might result
   in several other URIs being defined by the origin server.

   HTTP/1.1 does not define how a PUT method affects the state of an
   origin server.

   PUT requests MUST obey the message transmission requirements set out
   in Section 7.2 of [Part1].

   Unless otherwise specified for a particular entity-header, the
   entity-headers in the PUT request SHOULD be applied to the resource
   created or modified by the PUT.

8.7.  DELETE

   The DELETE method requests that the origin server delete the resource
   identified by the Request-URI.  This method MAY be overridden by
   human intervention (or other means) on the origin server.  The client
   cannot be guaranteed that the operation has been carried out, even if
   the status code returned from the origin server indicates that the
   action has been completed successfully.  However, the server SHOULD
   NOT indicate success unless, at the time the response is given, it
   intends to delete the resource or move it to an inaccessible
   location.

   A successful response SHOULD be 200 (OK) if the response includes an
   entity describing the status, 202 (Accepted) if the action has not
   yet been enacted, or 204 (No Content) if the action has been enacted
   but the response does not include an entity.

   If the request passes through a cache and the Request-URI identifies
   one or more currently cached entities, those entries SHOULD be
   treated as stale.  Responses to this method are not cacheable.

8.8.  TRACE

   The TRACE method is used to invoke a remote, application-layer loop-
   back of the request message.  The final recipient of the request
   SHOULD reflect the message received back to the client as the entity-
   body of a 200 (OK) response.  The final recipient is either the
   origin server or the first proxy or gateway to receive a Max-Forwards
   value of zero (0) in the request (see Section 10.5).  A TRACE request
   MUST NOT include an entity.

   TRACE allows the client to see what is being received at the other
   end of the request chain and use that data for testing or diagnostic
   information.  The value of the Via header field (Section 8.9 of



Fielding, et al.          Expires June 20, 2008                [Page 15]

Internet-Draft                  HTTP/1.1                   December 2007


   [Part1]) is of particular interest, since it acts as a trace of the
   request chain.  Use of the Max-Forwards header field allows the
   client to limit the length of the request chain, which is useful for
   testing a chain of proxies forwarding messages in an infinite loop.

   If the request is valid, the response SHOULD contain the entire
   request message in the entity-body, with a Content-Type of "message/
   http".  Responses to this method MUST NOT be cached.

8.9.  CONNECT

   This specification reserves the method name CONNECT for use with a
   proxy that can dynamically switch to being a tunnel (e.g.  SSL
   tunneling [Luo1998]).


9.  Status Code Definitions

   Each Status-Code is described below, including a description of which
   method(s) it can follow and any metainformation required in the
   response.

9.1.  Informational 1xx

   This class of status code indicates a provisional response,
   consisting only of the Status-Line and optional headers, and is
   terminated by an empty line.  There are no required headers for this
   class of status code.  Since HTTP/1.0 did not define any 1xx status
   codes, servers MUST NOT send a 1xx response to an HTTP/1.0 client
   except under experimental conditions.

   A client MUST be prepared to accept one or more 1xx status responses
   prior to a regular response, even if the client does not expect a 100
   (Continue) status message.  Unexpected 1xx status responses MAY be
   ignored by a user agent.

   Proxies MUST forward 1xx responses, unless the connection between the
   proxy and its client has been closed, or unless the proxy itself
   requested the generation of the 1xx response.  (For example, if a
   proxy adds a "Expect: 100-continue" field when it forwards a request,
   then it need not forward the corresponding 100 (Continue)
   response(s).)

9.1.1.  100 Continue

   The client SHOULD continue with its request.  This interim response
   is used to inform the client that the initial part of the request has
   been received and has not yet been rejected by the server.  The



Fielding, et al.          Expires June 20, 2008                [Page 16]

Internet-Draft                  HTTP/1.1                   December 2007


   client SHOULD continue by sending the remainder of the request or, if
   the request has already been completed, ignore this response.  The
   server MUST send a final response after the request has been
   completed.  See Section 7.2.3 of [Part1] for detailed discussion of
   the use and handling of this status code.

9.1.2.  101 Switching Protocols

   The server understands and is willing to comply with the client's
   request, via the Upgrade message header field (Section 5.4 of
   [Part5]), for a change in the application protocol being used on this
   connection.  The server will switch protocols to those defined by the
   response's Upgrade header field immediately after the empty line
   which terminates the 101 response.

   The protocol SHOULD be switched only when it is advantageous to do
   so.  For example, switching to a newer version of HTTP is
   advantageous over older versions, and switching to a real-time,
   synchronous protocol might be advantageous when delivering resources
   that use such features.

9.2.  Successful 2xx

   This class of status code indicates that the client's request was
   successfully received, understood, and accepted.

9.2.1.  200 OK

   The request has succeeded.  The information returned with the
   response is dependent on the method used in the request, for example:

   GET  an entity corresponding to the requested resource is sent in the
      response;

   HEAD  the entity-header fields corresponding to the requested
      resource are sent in the response without any message-body;

   POST  an entity describing or containing the result of the action;

   TRACE  an entity containing the request message as received by the
      end server.

9.2.2.  201 Created

   The request has been fulfilled and resulted in a new resource being
   created.  The newly created resource can be referenced by the URI(s)
   returned in the entity of the response, with the most specific URI
   for the resource given by a Location header field.  The response



Fielding, et al.          Expires June 20, 2008                [Page 17]

Internet-Draft                  HTTP/1.1                   December 2007


   SHOULD include an entity containing a list of resource
   characteristics and location(s) from which the user or user agent can
   choose the one most appropriate.  The entity format is specified by
   the media type given in the Content-Type header field.  The origin
   server MUST create the resource before returning the 201 status code.
   If the action cannot be carried out immediately, the server SHOULD
   respond with 202 (Accepted) response instead.

   A 201 response MAY contain an ETag response header field indicating
   the current value of the entity tag for the requested variant just
   created, see Section 6.1 of [Part4].

9.2.3.  202 Accepted

   The request has been accepted for processing, but the processing has
   not been completed.  The request might or might not eventually be
   acted upon, as it might be disallowed when processing actually takes
   place.  There is no facility for re-sending a status code from an
   asynchronous operation such as this.

   The 202 response is intentionally non-committal.  Its purpose is to
   allow a server to accept a request for some other process (perhaps a
   batch-oriented process that is only run once per day) without
   requiring that the user agent's connection to the server persist
   until the process is completed.  The entity returned with this
   response SHOULD include an indication of the request's current status
   and either a pointer to a status monitor or some estimate of when the
   user can expect the request to be fulfilled.

9.2.4.  203 Non-Authoritative Information

   The returned metainformation in the entity-header is not the
   definitive set as available from the origin server, but is gathered
   from a local or a third-party copy.  The set presented MAY be a
   subset or superset of the original version.  For example, including
   local annotation information about the resource might result in a
   superset of the metainformation known by the origin server.  Use of
   this response code is not required and is only appropriate when the
   response would otherwise be 200 (OK).

9.2.5.  204 No Content

   The server has fulfilled the request but does not need to return an
   entity-body, and might want to return updated metainformation.  The
   response MAY include new or updated metainformation in the form of
   entity-headers, which if present SHOULD be associated with the
   requested variant.




Fielding, et al.          Expires June 20, 2008                [Page 18]

Internet-Draft                  HTTP/1.1                   December 2007


   If the client is a user agent, it SHOULD NOT change its document view
   from that which caused the request to be sent.  This response is
   primarily intended to allow input for actions to take place without
   causing a change to the user agent's active document view, although
   any new or updated metainformation SHOULD be applied to the document
   currently in the user agent's active view.

   The 204 response MUST NOT include a message-body, and thus is always
   terminated by the first empty line after the header fields.

9.2.6.  205 Reset Content

   The server has fulfilled the request and the user agent SHOULD reset
   the document view which caused the request to be sent.  This response
   is primarily intended to allow input for actions to take place via
   user input, followed by a clearing of the form in which the input is
   given so that the user can easily initiate another input action.  The
   response MUST NOT include an entity.

9.2.7.  206 Partial Content

   The server has fulfilled the partial GET request for the resource and
   the enclosed entity is a partial representation as defined in
   [Part5].

9.3.  Redirection 3xx

   This class of status code indicates that further action needs to be
   taken by the user agent in order to fulfill the request.  The action
   required MAY be carried out by the user agent without interaction
   with the user if and only if the method used in the second request is
   GET or HEAD.  A client SHOULD detect infinite redirection loops,
   since such loops generate network traffic for each redirection.

      Note: previous versions of this specification recommended a
      maximum of five redirections.  Content developers should be aware
      that there might be clients that implement such a fixed
      limitation.

9.3.1.  300 Multiple Choices

   The requested resource corresponds to any one of a set of
   representations, each with its own specific location, and agent-
   driven negotiation information (Section 4 of [Part3]) is being
   provided so that the user (or user agent) can select a preferred
   representation and redirect its request to that location.

   Unless it was a HEAD request, the response SHOULD include an entity



Fielding, et al.          Expires June 20, 2008                [Page 19]

Internet-Draft                  HTTP/1.1                   December 2007


   containing a list of resource characteristics and location(s) from
   which the user or user agent can choose the one most appropriate.
   The entity format is specified by the media type given in the
   Content-Type header field.  Depending upon the format and the
   capabilities of the user agent, selection of the most appropriate
   choice MAY be performed automatically.  However, this specification
   does not define any standard for such automatic selection.

   If the server has a preferred choice of representation, it SHOULD
   include the specific URI for that representation in the Location
   field; user agents MAY use the Location field value for automatic
   redirection.  This response is cacheable unless indicated otherwise.

9.3.2.  301 Moved Permanently

   The requested resource has been assigned a new permanent URI and any
   future references to this resource SHOULD use one of the returned
   URIs.  Clients with link editing capabilities ought to automatically
   re-link references to the Request-URI to one or more of the new
   references returned by the server, where possible.  This response is
   cacheable unless indicated otherwise.

   The new permanent URI SHOULD be given by the Location field in the
   response.  Unless the request method was HEAD, the entity of the
   response SHOULD contain a short hypertext note with a hyperlink to
   the new URI(s).

   If the 301 status code is received in response to a request other
   than GET or HEAD, the user agent MUST NOT automatically redirect the
   request unless it can be confirmed by the user, since this might
   change the conditions under which the request was issued.

      Note: When automatically redirecting a POST request after
      receiving a 301 status code, some existing HTTP/1.0 user agents
      will erroneously change it into a GET request.

9.3.3.  302 Found

   The requested resource resides temporarily under a different URI.
   Since the redirection might be altered on occasion, the client SHOULD
   continue to use the Request-URI for future requests.  This response
   is only cacheable if indicated by a Cache-Control or Expires header
   field.

   The temporary URI SHOULD be given by the Location field in the
   response.  Unless the request method was HEAD, the entity of the
   response SHOULD contain a short hypertext note with a hyperlink to
   the new URI(s).



Fielding, et al.          Expires June 20, 2008                [Page 20]

Internet-Draft                  HTTP/1.1                   December 2007


   If the 302 status code is received in response to a request other
   than GET or HEAD, the user agent MUST NOT automatically redirect the
   request unless it can be confirmed by the user, since this might
   change the conditions under which the request was issued.

      Note: RFC 1945 and RFC 2068 specify that the client is not allowed
      to change the method on the redirected request.  However, most
      existing user agent implementations treat 302 as if it were a 303
      response, performing a GET on the Location field-value regardless
      of the original request method.  The status codes 303 and 307 have
      been added for servers that wish to make unambiguously clear which
      kind of reaction is expected of the client.

9.3.4.  303 See Other

   The response to the request can be found under a different URI and
   SHOULD be retrieved using a GET method on that resource.  This method
   exists primarily to allow the output of a POST-activated script to
   redirect the user agent to a selected resource.  The new URI is not a
   substitute reference for the originally requested resource.  The 303
   response MUST NOT be cached, but the response to the second
   (redirected) request might be cacheable.

   The different URI SHOULD be given by the Location field in the
   response.  Unless the request method was HEAD, the entity of the
   response SHOULD contain a short hypertext note with a hyperlink to
   the new URI(s).

      Note: Many pre-HTTP/1.1 user agents do not understand the 303
      status.  When interoperability with such clients is a concern, the
      302 status code may be used instead, since most user agents react
      to a 302 response as described here for 303.

9.3.5.  304 Not Modified

   The response to the request has not been modified since the
   conditions indicated by the client's conditional GET request, as
   defined in [Part4].

9.3.6.  305 Use Proxy

   The requested resource MUST be accessed through the proxy given by
   the Location field.  The Location field gives the URI of the proxy.
   The recipient is expected to repeat this single request via the
   proxy. 305 responses MUST only be generated by origin servers.

      Note: RFC 2068 was not clear that 305 was intended to redirect a
      single request, and to be generated by origin servers only.  Not



Fielding, et al.          Expires June 20, 2008                [Page 21]

Internet-Draft                  HTTP/1.1                   December 2007


      observing these limitations has significant security consequences.

9.3.7.  306 (Unused)

   The 306 status code was used in a previous version of the
   specification, is no longer used, and the code is reserved.

9.3.8.  307 Temporary Redirect

   The requested resource resides temporarily under a different URI.
   Since the redirection MAY be altered on occasion, the client SHOULD
   continue to use the Request-URI for future requests.  This response
   is only cacheable if indicated by a Cache-Control or Expires header
   field.

   The temporary URI SHOULD be given by the Location field in the
   response.  Unless the request method was HEAD, the entity of the
   response SHOULD contain a short hypertext note with a hyperlink to
   the new URI(s) , since many pre-HTTP/1.1 user agents do not
   understand the 307 status.  Therefore, the note SHOULD contain the
   information necessary for a user to repeat the original request on
   the new URI.

   If the 307 status code is received in response to a request other
   than GET or HEAD, the user agent MUST NOT automatically redirect the
   request unless it can be confirmed by the user, since this might
   change the conditions under which the request was issued.

9.4.  Client Error 4xx

   The 4xx class of status code is intended for cases in which the
   client seems to have erred.  Except when responding to a HEAD
   request, the server SHOULD include an entity containing an
   explanation of the error situation, and whether it is a temporary or
   permanent condition.  These status codes are applicable to any
   request method.  User agents SHOULD display any included entity to
   the user.

   If the client is sending data, a server implementation using TCP
   SHOULD be careful to ensure that the client acknowledges receipt of
   the packet(s) containing the response, before the server closes the
   input connection.  If the client continues sending data to the server
   after the close, the server's TCP stack will send a reset packet to
   the client, which may erase the client's unacknowledged input buffers
   before they can be read and interpreted by the HTTP application.






Fielding, et al.          Expires June 20, 2008                [Page 22]

Internet-Draft                  HTTP/1.1                   December 2007


9.4.1.  400 Bad Request

   The request could not be understood by the server due to malformed
   syntax.  The client SHOULD NOT repeat the request without
   modifications.

9.4.2.  401 Unauthorized

   The request requires user authentication (see [Part7]).

9.4.3.  402 Payment Required

   This code is reserved for future use.

9.4.4.  403 Forbidden

   The server understood the request, but is refusing to fulfill it.
   Authorization will not help and the request SHOULD NOT be repeated.
   If the request method was not HEAD and the server wishes to make
   public why the request has not been fulfilled, it SHOULD describe the
   reason for the refusal in the entity.  If the server does not wish to
   make this information available to the client, the status code 404
   (Not Found) can be used instead.

9.4.5.  404 Not Found

   The server has not found anything matching the Request-URI.  No
   indication is given of whether the condition is temporary or
   permanent.  The 410 (Gone) status code SHOULD be used if the server
   knows, through some internally configurable mechanism, that an old
   resource is permanently unavailable and has no forwarding address.
   This status code is commonly used when the server does not wish to
   reveal exactly why the request has been refused, or when no other
   response is applicable.

9.4.6.  405 Method Not Allowed

   The method specified in the Request-Line is not allowed for the
   resource identified by the Request-URI.  The response MUST include an
   Allow header containing a list of valid methods for the requested
   resource.

9.4.7.  406 Not Acceptable

   The resource identified by the request is only capable of generating
   response entities which have content characteristics not acceptable
   according to the accept headers sent in the request.




Fielding, et al.          Expires June 20, 2008                [Page 23]

Internet-Draft                  HTTP/1.1                   December 2007


   Unless it was a HEAD request, the response SHOULD include an entity
   containing a list of available entity characteristics and location(s)
   from which the user or user agent can choose the one most
   appropriate.  The entity format is specified by the media type given
   in the Content-Type header field.  Depending upon the format and the
   capabilities of the user agent, selection of the most appropriate
   choice MAY be performed automatically.  However, this specification
   does not define any standard for such automatic selection.

      Note: HTTP/1.1 servers are allowed to return responses which are
      not acceptable according to the accept headers sent in the
      request.  In some cases, this may even be preferable to sending a
      406 response.  User agents are encouraged to inspect the headers
      of an incoming response to determine if it is acceptable.

   If the response could be unacceptable, a user agent SHOULD
   temporarily stop receipt of more data and query the user for a
   decision on further actions.

9.4.8.  407 Proxy Authentication Required

   This code is similar to 401 (Unauthorized), but indicates that the
   client must first authenticate itself with the proxy (see [Part7]).

9.4.9.  408 Request Timeout

   The client did not produce a request within the time that the server
   was prepared to wait.  The client MAY repeat the request without
   modifications at any later time.

9.4.10.  409 Conflict

   The request could not be completed due to a conflict with the current
   state of the resource.  This code is only allowed in situations where
   it is expected that the user might be able to resolve the conflict
   and resubmit the request.  The response body SHOULD include enough
   information for the user to recognize the source of the conflict.
   Ideally, the response entity would include enough information for the
   user or user agent to fix the problem; however, that might not be
   possible and is not required.

   Conflicts are most likely to occur in response to a PUT request.  For
   example, if versioning were being used and the entity being PUT
   included changes to a resource which conflict with those made by an
   earlier (third-party) request, the server might use the 409 response
   to indicate that it can't complete the request.  In this case, the
   response entity would likely contain a list of the differences
   between the two versions in a format defined by the response Content-



Fielding, et al.          Expires June 20, 2008                [Page 24]

Internet-Draft                  HTTP/1.1                   December 2007


   Type.

9.4.11.  410 Gone

   The requested resource is no longer available at the server and no
   forwarding address is known.  This condition is expected to be
   considered permanent.  Clients with link editing capabilities SHOULD
   delete references to the Request-URI after user approval.  If the
   server does not know, or has no facility to determine, whether or not
   the condition is permanent, the status code 404 (Not Found) SHOULD be
   used instead.  This response is cacheable unless indicated otherwise.

   The 410 response is primarily intended to assist the task of web
   maintenance by notifying the recipient that the resource is
   intentionally unavailable and that the server owners desire that
   remote links to that resource be removed.  Such an event is common
   for limited-time, promotional services and for resources belonging to
   individuals no longer working at the server's site.  It is not
   necessary to mark all permanently unavailable resources as "gone" or
   to keep the mark for any length of time -- that is left to the
   discretion of the server owner.

9.4.12.  411 Length Required

   The server refuses to accept the request without a defined Content-
   Length.  The client MAY repeat the request if it adds a valid
   Content-Length header field containing the length of the message-body
   in the request message.

9.4.13.  412 Precondition Failed

   The precondition given in one or more of the request-header fields
   evaluated to false when it was tested on the server, as defined in
   [Part4].

9.4.14.  413 Request Entity Too Large

   The server is refusing to process a request because the request
   entity is larger than the server is willing or able to process.  The
   server MAY close the connection to prevent the client from continuing
   the request.

   If the condition is temporary, the server SHOULD include a Retry-
   After header field to indicate that it is temporary and after what
   time the client MAY try again.






Fielding, et al.          Expires June 20, 2008                [Page 25]

Internet-Draft                  HTTP/1.1                   December 2007


9.4.15.  414 Request-URI Too Long

   The server is refusing to service the request because the Request-URI
   is longer than the server is willing to interpret.  This rare
   condition is only likely to occur when a client has improperly
   converted a POST request to a GET request with long query
   information, when the client has descended into a URI "black hole" of
   redirection (e.g., a redirected URI prefix that points to a suffix of
   itself), or when the server is under attack by a client attempting to
   exploit security holes present in some servers using fixed-length
   buffers for reading or manipulating the Request-URI.

9.4.16.  415 Unsupported Media Type

   The server is refusing to service the request because the entity of
   the request is in a format not supported by the requested resource
   for the requested method.

9.4.17.  416 Requested Range Not Satisfiable

   The request included a Range request-header field (Section 5.4 of
   [Part5]) and none of the range-specifier values in this field overlap
   the current extent of the selected resource.

9.4.18.  417 Expectation Failed

   The expectation given in an Expect request-header field (see
   Section 10.2) could not be met by this server, or, if the server is a
   proxy, the server has unambiguous evidence that the request could not
   be met by the next-hop server.

9.5.  Server Error 5xx

   Response status codes beginning with the digit "5" indicate cases in
   which the server is aware that it has erred or is incapable of
   performing the request.  Except when responding to a HEAD request,
   the server SHOULD include an entity containing an explanation of the
   error situation, and whether it is a temporary or permanent
   condition.  User agents SHOULD display any included entity to the
   user.  These response codes are applicable to any request method.

9.5.1.  500 Internal Server Error

   The server encountered an unexpected condition which prevented it
   from fulfilling the request.






Fielding, et al.          Expires June 20, 2008                [Page 26]

Internet-Draft                  HTTP/1.1                   December 2007


9.5.2.  501 Not Implemented

   The server does not support the functionality required to fulfill the
   request.  This is the appropriate response when the server does not
   recognize the request method and is not capable of supporting it for
   any resource.

9.5.3.  502 Bad Gateway

   The server, while acting as a gateway or proxy, received an invalid
   response from the upstream server it accessed in attempting to
   fulfill the request.

9.5.4.  503 Service Unavailable

   The server is currently unable to handle the request due to a
   temporary overloading or maintenance of the server.  The implication
   is that this is a temporary condition which will be alleviated after
   some delay.  If known, the length of the delay MAY be indicated in a
   Retry-After header.  If no Retry-After is given, the client SHOULD
   handle the response as it would for a 500 response.

      Note: The existence of the 503 status code does not imply that a
      server must use it when becoming overloaded.  Some servers may
      wish to simply refuse the connection.

9.5.5.  504 Gateway Timeout

   The server, while acting as a gateway or proxy, did not receive a
   timely response from the upstream server specified by the URI (e.g.
   HTTP, FTP, LDAP) or some other auxiliary server (e.g.  DNS) it needed
   to access in attempting to complete the request.

      Note: Note to implementors: some deployed proxies are known to
      return 400 or 500 when DNS lookups time out.

9.5.6.  505 HTTP Version Not Supported

   The server does not support, or refuses to support, the HTTP protocol
   version that was used in the request message.  The server is
   indicating that it is unable or unwilling to complete the request
   using the same major version as the client, as described in Section
   3.1 of [Part1], other than with this error message.  The response
   SHOULD contain an entity describing why that version is not supported
   and what other protocols are supported by that server.






Fielding, et al.          Expires June 20, 2008                [Page 27]

Internet-Draft                  HTTP/1.1                   December 2007


10.  Header Field Definitions

   This section defines the syntax and semantics of all standard
   HTTP/1.1 header fields.  For entity-header fields, both sender and
   recipient refer to either the client or the server, depending on who
   sends and who receives the entity.

10.1.  Allow

   The Allow entity-header field lists the set of methods supported by
   the resource identified by the Request-URI.  The purpose of this
   field is strictly to inform the recipient of valid methods associated
   with the resource.  An Allow header field MUST be present in a 405
   (Method Not Allowed) response.

          Allow   = "Allow" ":" #Method

   Example of use:

          Allow: GET, HEAD, PUT

   This field cannot prevent a client from trying other methods.
   However, the indications given by the Allow header field value SHOULD
   be followed.  The actual set of allowed methods is defined by the
   origin server at the time of each request.

   The Allow header field MAY be provided with a PUT request to
   recommend the methods to be supported by the new or modified
   resource.  The server is not required to support these methods and
   SHOULD include an Allow header in the response giving the actual
   supported methods.

   A proxy MUST NOT modify the Allow header field even if it does not
   understand all the methods specified, since the user agent might have
   other means of communicating with the origin server.

10.2.  Expect

   The Expect request-header field is used to indicate that particular
   server behaviors are required by the client.

      Expect       =  "Expect" ":" 1#expectation

      expectation  =  "100-continue" | expectation-extension
      expectation-extension =  token [ "=" ( token | quoted-string )
                               *expect-params ]
      expect-params =  ";" token [ "=" ( token | quoted-string ) ]




Fielding, et al.          Expires June 20, 2008                [Page 28]

Internet-Draft                  HTTP/1.1                   December 2007


   A server that does not understand or is unable to comply with any of
   the expectation values in the Expect field of a request MUST respond
   with appropriate error status.  The server MUST respond with a 417
   (Expectation Failed) status if any of the expectations cannot be met
   or, if there are other problems with the request, some other 4xx
   status.

   This header field is defined with extensible syntax to allow for
   future extensions.  If a server receives a request containing an
   Expect field that includes an expectation-extension that it does not
   support, it MUST respond with a 417 (Expectation Failed) status.

   Comparison of expectation values is case-insensitive for unquoted
   tokens (including the 100-continue token), and is case-sensitive for
   quoted-string expectation-extensions.

   The Expect mechanism is hop-by-hop: that is, an HTTP/1.1 proxy MUST
   return a 417 (Expectation Failed) status if it receives a request
   with an expectation that it cannot meet.  However, the Expect
   request-header itself is end-to-end; it MUST be forwarded if the
   request is forwarded.

   Many older HTTP/1.0 and HTTP/1.1 applications do not understand the
   Expect header.

   See Section 7.2.3 of [Part1] for the use of the 100 (continue)
   status.

10.3.  From

   The From request-header field, if given, SHOULD contain an Internet
   e-mail address for the human user who controls the requesting user
   agent.  The address SHOULD be machine-usable, as defined by "mailbox"
   in RFC 822 [RFC822] as updated by RFC 1123 [RFC1123]:

       From   = "From" ":" mailbox

   An example is:

       From: webmaster@w3.org

   This header field MAY be used for logging purposes and as a means for
   identifying the source of invalid or unwanted requests.  It SHOULD
   NOT be used as an insecure form of access protection.  The
   interpretation of this field is that the request is being performed
   on behalf of the person given, who accepts responsibility for the
   method performed.  In particular, robot agents SHOULD include this
   header so that the person responsible for running the robot can be



Fielding, et al.          Expires June 20, 2008                [Page 29]

Internet-Draft                  HTTP/1.1                   December 2007


   contacted if problems occur on the receiving end.

   The Internet e-mail address in this field MAY be separate from the
   Internet host which issued the request.  For example, when a request
   is passed through a proxy the original issuer's address SHOULD be
   used.

   The client SHOULD NOT send the From header field without the user's
   approval, as it might conflict with the user's privacy interests or
   their site's security policy.  It is strongly recommended that the
   user be able to disable, enable, and modify the value of this field
   at any time prior to a request.

10.4.  Location

   The Location response-header field is used to redirect the recipient
   to a location other than the Request-URI for completion of the
   request or identification of a new resource.  For 201 (Created)
   responses, the Location is that of the new resource which was created
   by the request.  For 3xx responses, the location SHOULD indicate the
   server's preferred URI for automatic redirection to the resource.
   The field value consists of a single absolute URI.

       Location       = "Location" ":" absoluteURI

   An example is:

       Location: http://www.w3.org/pub/WWW/People.html

      Note: The Content-Location header field (Section 5.7 of [Part3])
      differs from Location in that the Content-Location identifies the
      original location of the entity enclosed in the request.  It is
      therefore possible for a response to contain header fields for
      both Location and Content-Location.

10.5.  Max-Forwards

   The Max-Forwards request-header field provides a mechanism with the
   TRACE (Section 8.8) and OPTIONS (Section 8.2) methods to limit the
   number of proxies or gateways that can forward the request to the
   next inbound server.  This can be useful when the client is
   attempting to trace a request chain which appears to be failing or
   looping in mid-chain.

       Max-Forwards   = "Max-Forwards" ":" 1*DIGIT

   The Max-Forwards value is a decimal integer indicating the remaining
   number of times this request message may be forwarded.



Fielding, et al.          Expires June 20, 2008                [Page 30]

Internet-Draft                  HTTP/1.1                   December 2007


   Each proxy or gateway recipient of a TRACE or OPTIONS request
   containing a Max-Forwards header field MUST check and update its
   value prior to forwarding the request.  If the received value is zero
   (0), the recipient MUST NOT forward the request; instead, it MUST
   respond as the final recipient.  If the received Max-Forwards value
   is greater than zero, then the forwarded message MUST contain an
   updated Max-Forwards field with a value decremented by one (1).

   The Max-Forwards header field MAY be ignored for all other methods
   defined by this specification and for any extension methods for which
   it is not explicitly referred to as part of that method definition.

10.6.  Referer

   The Referer[sic] request-header field allows the client to specify,
   for the server's benefit, the address (URI) of the resource from
   which the Request-URI was obtained (the "referrer", although the
   header field is misspelled.)  The Referer request-header allows a
   server to generate lists of back-links to resources for interest,
   logging, optimized caching, etc.  It also allows obsolete or mistyped
   links to be traced for maintenance.  The Referer field MUST NOT be
   sent if the Request-URI was obtained from a source that does not have
   its own URI, such as input from the user keyboard.

       Referer        = "Referer" ":" ( absoluteURI | relativeURI )

   Example:

       Referer: http://www.w3.org/hypertext/DataSources/Overview.html

   If the field value is a relative URI, it SHOULD be interpreted
   relative to the Request-URI.  The URI MUST NOT include a fragment.
   See Section 12.2 for security considerations.

10.7.  Retry-After

   The Retry-After response-header field can be used with a 503 (Service
   Unavailable) response to indicate how long the service is expected to
   be unavailable to the requesting client.  This field MAY also be used
   with any 3xx (Redirection) response to indicate the minimum time the
   user-agent is asked wait before issuing the redirected request.  The
   value of this field can be either an HTTP-date or an integer number
   of seconds (in decimal) after the time of the response.

       Retry-After  = "Retry-After" ":" ( HTTP-date | delta-seconds )

   Two examples of its use are




Fielding, et al.          Expires June 20, 2008                [Page 31]

Internet-Draft                  HTTP/1.1                   December 2007


       Retry-After: Fri, 31 Dec 1999 23:59:59 GMT
       Retry-After: 120

   In the latter example, the delay is 2 minutes.

10.8.  Server

   The Server response-header field contains information about the
   software used by the origin server to handle the request.  The field
   can contain multiple product tokens (Section 2) and comments
   identifying the server and any significant subproducts.  The product
   tokens are listed in order of their significance for identifying the
   application.

       Server         = "Server" ":" 1*( product | comment )

   Example:

       Server: CERN/3.0 libwww/2.17

   If the response is being forwarded through a proxy, the proxy
   application MUST NOT modify the Server response-header.  Instead, it
   SHOULD include a Via field (as described in Section 8.9 of [Part1]).

      Note: Revealing the specific software version of the server might
      allow the server machine to become more vulnerable to attacks
      against software that is known to contain security holes.  Server
      implementors are encouraged to make this field a configurable
      option.

10.9.  User-Agent

   The User-Agent request-header field contains information about the
   user agent originating the request.  This is for statistical
   purposes, the tracing of protocol violations, and automated
   recognition of user agents for the sake of tailoring responses to
   avoid particular user agent limitations.  User agents SHOULD include
   this field with requests.  The field can contain multiple product
   tokens (Section 2) and comments identifying the agent and any
   subproducts which form a significant part of the user agent.  By
   convention, the product tokens are listed in order of their
   significance for identifying the application.

       User-Agent     = "User-Agent" ":" 1*( product | comment )

   Example:

       User-Agent: CERN-LineMode/2.15 libwww/2.17b3



Fielding, et al.          Expires June 20, 2008                [Page 32]

Internet-Draft                  HTTP/1.1                   December 2007


11.  IANA Considerations

   TBD.


12.  Security Considerations

   This section is meant to inform application developers, information
   providers, and users of the security limitations in HTTP/1.1 as
   described by this document.  The discussion does not include
   definitive solutions to the problems revealed, though it does make
   some suggestions for reducing security risks.

12.1.  Transfer of Sensitive Information

   Like any generic data transfer protocol, HTTP cannot regulate the
   content of the data that is transferred, nor is there any a priori
   method of determining the sensitivity of any particular piece of
   information within the context of any given request.  Therefore,
   applications SHOULD supply as much control over this information as
   possible to the provider of that information.  Four header fields are
   worth special mention in this context: Server, Via, Referer and From.

   Revealing the specific software version of the server might allow the
   server machine to become more vulnerable to attacks against software
   that is known to contain security holes.  Implementors SHOULD make
   the Server header field a configurable option.

   Proxies which serve as a portal through a network firewall SHOULD
   take special precautions regarding the transfer of header information
   that identifies the hosts behind the firewall.  In particular, they
   SHOULD remove, or replace with sanitized versions, any Via fields
   generated behind the firewall.

   The Referer header allows reading patterns to be studied and reverse
   links drawn.  Although it can be very useful, its power can be abused
   if user details are not separated from the information contained in
   the Referer.  Even when the personal information has been removed,
   the Referer header might indicate a private document's URI whose
   publication would be inappropriate.

   The information sent in the From field might conflict with the user's
   privacy interests or their site's security policy, and hence it
   SHOULD NOT be transmitted without the user being able to disable,
   enable, and modify the contents of the field.  The user MUST be able
   to set the contents of this field within a user preference or
   application defaults configuration.




Fielding, et al.          Expires June 20, 2008                [Page 33]

Internet-Draft                  HTTP/1.1                   December 2007


   We suggest, though do not require, that a convenient toggle interface
   be provided for the user to enable or disable the sending of From and
   Referer information.

   The User-Agent (Section 10.9) or Server (Section 10.8) header fields
   can sometimes be used to determine that a specific client or server
   have a particular security hole which might be exploited.
   Unfortunately, this same information is often used for other valuable
   purposes for which HTTP currently has no better mechanism.

12.2.  Encoding Sensitive Information in URI's

   Because the source of a link might be private information or might
   reveal an otherwise private information source, it is strongly
   recommended that the user be able to select whether or not the
   Referer field is sent.  For example, a browser client could have a
   toggle switch for browsing openly/anonymously, which would
   respectively enable/disable the sending of Referer and From
   information.

   Clients SHOULD NOT include a Referer header field in a (non-secure)
   HTTP request if the referring page was transferred with a secure
   protocol.

   Authors of services which use the HTTP protocol SHOULD NOT use GET
   based forms for the submission of sensitive data, because this will
   cause this data to be encoded in the Request-URI.  Many existing
   servers, proxies, and user agents will log the request URI in some
   place where it might be visible to third parties.  Servers can use
   POST-based form submission instead

12.3.  Location Headers and Spoofing

   If a single server supports multiple organizations that do not trust
   one another, then it MUST check the values of Location and Content-
   Location headers in responses that are generated under control of
   said organizations to make sure that they do not attempt to
   invalidate resources over which they have no authority.


13.  Acknowledgments

   Based on an XML translation of RFC 2616 by Julian Reschke.


14.  References

   [Luo1998]  Luotonen, A., "Tunneling TCP based protocols through Web



Fielding, et al.          Expires June 20, 2008                [Page 34]

Internet-Draft                  HTTP/1.1                   December 2007


              proxy servers",  Work in Progress.

   [Part1]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 1: URIs, Connections, and Message Parsing",
              draft-ietf-httpbis-p1-messaging-00 (work in progress),
              December 2007.

   [Part3]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 3: Message Payload and Content Negotiation",
              draft-ietf-httpbis-p3-payload-00 (work in progress),
              December 2007.

   [Part4]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 4: Conditional Requests",
              draft-ietf-httpbis-p4-conditional-00 (work in progress),
              December 2007.

   [Part5]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 5: Range Requests and Partial Responses",
              draft-ietf-httpbis-p5-range-00 (work in progress),
              December 2007.

   [Part6]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 6: Caching", draft-ietf-httpbis-p6-cache-00 (work in
              progress), December 2007.

   [Part7]    Fielding, R., Ed., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "HTTP/1.1,
              part 7: Authentication", draft-ietf-httpbis-p7-auth-00
              (work in progress), December 2007.

   [RFC1123]  Braden, R., "Requirements for Internet Hosts - Application
              and Support", STD 3, RFC 1123, October 1989.

   [RFC2068]  Fielding, R., Gettys, J., Mogul, J., Nielsen, H., and T.
              Berners-Lee, "Hypertext Transfer Protocol -- HTTP/1.1",
              RFC 2068, January 1997.

   [RFC2616]  Fielding, R., Gettys, J., Mogul, J., Frystyk, H.,
              Masinter, L., Leach, P., and T. Berners-Lee, "Hypertext
              Transfer Protocol -- HTTP/1.1", RFC 2616, June 1999.

   [RFC822]   Crocker, D., "Standard for the format of ARPA Internet



Fielding, et al.          Expires June 20, 2008                [Page 35]

Internet-Draft                  HTTP/1.1                   December 2007


              text messages", STD 11, RFC 822, August 1982.


Appendix A.  Changes from RFC 2068

   Clarified which error code should be used for inbound server failures
   (e.g.  DNS failures).  (Section 9.5.5).

   CREATE had a race that required an Etag be sent when a resource is
   first created.  (Section 9.2.2).

   Rewrite of message transmission requirements to make it much harder
   for implementors to get it wrong, as the consequences of errors here
   can have significant impact on the Internet, and to deal with the
   following problems:

   1.  Changing "HTTP/1.1 or later" to "HTTP/1.1", in contexts where
       this was incorrectly placing a requirement on the behavior of an
       implementation of a future version of HTTP/1.x

   2.  Made it clear that user-agents should retry requests, not
       "clients" in general.

   3.  Converted requirements for clients to ignore unexpected 100
       (Continue) responses, and for proxies to forward 100 responses,
       into a general requirement for 1xx responses.

   4.  Modified some TCP-specific language, to make it clearer that non-
       TCP transports are possible for HTTP.

   5.  Require that the origin server MUST NOT wait for the request body
       before it sends a required 100 (Continue) response.

   6.  Allow, rather than require, a server to omit 100 (Continue) if it
       has already seen some of the request body.

   7.  Allow servers to defend against denial-of-service attacks and
       broken clients.

   This change adds the Expect header and 417 status code.

   Clean up confusion between 403 and 404 responses.  (Section 9.4.4,
   9.4.5, and 9.4.11)

   The PATCH, LINK, UNLINK methods were defined but not commonly
   implemented in previous versions of this specification.  See RFC 2068
   [RFC2068].




Fielding, et al.          Expires June 20, 2008                [Page 36]

Internet-Draft                  HTTP/1.1                   December 2007


Index

   1
      100 Continue (status code)  16
      101 Switching Protocols (status code)  17

   2
      200 OK (status code)  17
      201 Created (status code)  17
      202 Accepted (status code)  18
      203 Non-Authoritative Information (status code)  18
      204 No Content (status code)  18
      205 Reset Content (status code)  19
      206 Partial Content (status code)  19

   3
      300 Multiple Choices (status code)  19
      301 Moved Permanently (status code)  20
      302 Found (status code)  20
      303 See Other (status code)  21
      304 Not Modified (status code)  21
      305 Use Proxy (status code)  21
      306 (Unused) (status code)  22
      307 Temporary Redirect (status code)  22

   4
      400 Bad Request (status code)  23
      401 Unauthorized (status code)  23
      402 Payment Required (status code)  23
      403 Forbidden (status code)  23
      404 Not Found (status code)  23
      405 Method Not Allowed (status code)  23
      406 Not Acceptable (status code)  23
      407 Proxy Authentication Required (status code)  24
      408 Request Timeout (status code)  24
      409 Conflict (status code)  24
      410 Gone (status code)  25
      411 Length Required (status code)  25
      412 Precondition Failed (status code)  25
      413 Request Entity Too Large (status code)  25
      414 Request-URI Too Long (status code)  26
      415 Unsupported Media Type (status code)  26
      416 Requested Range Not Satisfiable (status code)  26
      417 Expectation Failed (status code)  26

   5
      500 Internal Server Error (status code)  26
      501 Not Implemented (status code)  27



Fielding, et al.          Expires June 20, 2008                [Page 37]

Internet-Draft                  HTTP/1.1                   December 2007


      502 Bad Gateway (status code)  27
      503 Service Unavailable (status code)  27
      504 Gateway Timeout (status code)  27
      505 HTTP Version Not Supported (status code)  27

   A
      Allow header  28

   C
      CONNECT method  16

   D
      DELETE method  15

   E
      Expect header  28

   F
      From header  29

   G
      GET method  12
      Grammar
         Allow  28
         Expect  28
         expect-params  28
         expectation  28
         expectation-extension  28
         extension-code  8
         extension-method  6
         From  29
         Location  30
         Max-Forwards  30
         Method  6
         product  5
         product-version  5
         Reason-Phrase  8
         Referer  31
         request-header  7
         response-header  9
         Retry-After  31
         Server  32
         Status-Code  8
         User-Agent  32

   H
      HEAD method  12
      Headers



Fielding, et al.          Expires June 20, 2008                [Page 38]

Internet-Draft                  HTTP/1.1                   December 2007


         Allow  28
         Expect  28
         From  29
         Location  30
         Max-Forwards  30
         Referer  31
         Retry-After  31
         Server  32
         User-Agent  32

   L
      LINK method  36
      Location header  30

   M
      Max-Forwards header  30
      Methods
         CONNECT  16
         DELETE  15
         GET  12
         HEAD  12
         LINK  36
         OPTIONS  11
         PATCH  36
         POST  13
         PUT  14
         TRACE  15
         UNLINK  36

   O
      OPTIONS method  11

   P
      PATCH method  36
      POST method  13
      PUT method  14

   R
      Referer header  31
      Retry-After header  31

   S
      Server header  32
      Status Codes
         100 Continue  16
         101 Switching Protocols  17
         200 OK  17
         201 Created  17



Fielding, et al.          Expires June 20, 2008                [Page 39]

Internet-Draft                  HTTP/1.1                   December 2007


         202 Accepted  18
         203 Non-Authoritative Information  18
         204 No Content  18
         205 Reset Content  19
         206 Partial Content  19
         300 Multiple Choices  19
         301 Moved Permanently  20
         302 Found  20
         303 See Other  21
         304 Not Modified  21
         305 Use Proxy  21
         306 (Unused)  22
         307 Temporary Redirect  22
         400 Bad Request  23
         401 Unauthorized  23
         402 Payment Required  23
         403 Forbidden  23
         404 Not Found  23
         405 Method Not Allowed  23
         406 Not Acceptable  23
         407 Proxy Authentication Required  24
         408 Request Timeout  24
         409 Conflict  24
         410 Gone  25
         411 Length Required  25
         412 Precondition Failed  25
         413 Request Entity Too Large  25
         414 Request-URI Too Long  26
         415 Unsupported Media Type  26
         416 Requested Range Not Satisfiable  26
         417 Expectation Failed  26
         500 Internal Server Error  26
         501 Not Implemented  27
         502 Bad Gateway  27
         503 Service Unavailable  27
         504 Gateway Timeout  27
         505 HTTP Version Not Supported  27

   T
      TRACE method  15

   U
      UNLINK method  36
      User-Agent header  32







Fielding, et al.          Expires June 20, 2008                [Page 40]

Internet-Draft                  HTTP/1.1                   December 2007


Authors' Addresses

   Roy T. Fielding (editor)
   Day Software
   23 Corporate Plaza DR, Suite 280
   Newport Beach, CA  92660
   USA

   Phone: +1-949-706-5300
   Fax:   +1-949-706-5305
   Email: fielding@gbiv.com
   URI:   http://roy.gbiv.com/


   Jim Gettys
   One Laptop per Child
   21 Oak Knoll Road
   Carlisle, MA  01741
   USA

   Email: jg@laptop.org
   URI:   http://www.laptop.org/


   Jeffrey C. Mogul
   Hewlett-Packard Company
   HP Labs, Large Scale Systems Group
   1501 Page Mill Road, MS 1177
   Palo Alto, CA  94304
   USA

   Email: JeffMogul@acm.org


   Henrik Frystyk Nielsen
   Microsoft Corporation
   1 Microsoft Way
   Redmond, WA  98052
   USA

   Email: henrikn@microsoft.com










Fielding, et al.          Expires June 20, 2008                [Page 41]

Internet-Draft                  HTTP/1.1                   December 2007


   Larry Masinter
   Adobe Systems, Incorporated
   345 Park Ave
   San Jose, CA  95110
   USA

   Email: LMM@acm.org
   URI:   http://larry.masinter.net/


   Paul J. Leach
   Microsoft Corporation
   1 Microsoft Way
   Redmond, WA  98052

   Email: paulle@microsoft.com


   Tim Berners-Lee
   World Wide Web Consortium
   MIT Computer Science and Artificial Intelligence Laboratory
   The Stata Center, Building 32
   32 Vassar Street
   Cambridge, MA  02139
   USA

   Email: timbl@w3.org
   URI:   http://www.w3.org/People/Berners-Lee/























Fielding, et al.          Expires June 20, 2008                [Page 42]

Internet-Draft                  HTTP/1.1                   December 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Fielding, et al.          Expires June 20, 2008                [Page 43]

